Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
1472075628000" -> "1758162472948857000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ccd5e51124fb3cf51ca53fb6286f006d5491a8434a03847a0b792a34bac4ce00.zip" -> "builds/7b4867088cabd4e44f7dc896e0d01710ecd3f8aa4478f82846dab0a7740f9cae.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-08-25T08:48:26.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7b4867088cabd4e44f7dc896e0d01710ecd3f8aa4478f82846dab0a7740f9cae.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7b4867088cabd4e44f7dc896e0d01710ecd3f8aa4478f82846dab0a7740f9cae.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4305689953675712518" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ccd5e51124fb3cf51ca53fb6286f006d5491a8434a03847a0b792a34bac4ce00.zip" -> "builds/7b4867088cabd4e44f7dc896e0d01710ecd3f8aa4478f82846dab0a7740f9cae.zip"
          ~ "timestamp" = "1756111472278018000" -> "1758162473022477000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:5472cf0eab296dc8deab8e4e3e6af0cbf62b5d8ffef5f71915852fec454c4fd1" -> (known after apply)
      ~ last_modified                  = "2025-08-25T08:49:45.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1612385254487562686" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111472514987000" -> "1758162473541483000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4647501076006820723" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111471121997200" -> "1758162473379118000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2961804136648506169" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111471548683000" -> "1758162475034048000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7457746780912108241" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111471980865000" -> "1758162473252952000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2830787737109042160" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111472220923000" -> "1758162475883606000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5403675837179448570" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111471276284000" -> "1758162473526038000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16" -> (known after apply)
      ~ code_sha256                 = "Amq1IkgWmJL5tXM4aJTntQZPjhOTezvOThv/P3TJF6A=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-25T08:48:21.106+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 37622 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250815040234005900000003/builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "e77c0b610e9db1644fc3da17c0f11a3b" -> (known after apply)
      ~ id                            = "svep-backend-layers-20250815040234005900000003/builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> (known after apply)
      ~ key                           = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1762326486056651827" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip"
          ~ "timestamp" = "1756111471821086000" -> "1758162473963816000"
        }
    }

Plan: 77 to add, 54 to change, 65 to destroy.
module.webgui.terraform_data.cloudfront-version-invalidate: Destroying... [id=e4015c17-a4f1-736a-4c08-3778cefdc10a]
module.webgui.terraform_data.cloudfront-version-invalidate: Destruction complete after 0s
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=910082800170648383]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.webgui.null_resource.s3-upload: Destroying... [id=2843852217012278194]
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creation complete after 0s [id=1e73cf5a20f298ed44182bffa5496b2c572bf4dd]
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creation complete after 0s [id=6c3243530cbcb6df003f87a230f5182811ee7ecf]
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip' archive
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/sendJobEmail
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created: builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 0s [id=6762945615508699709]
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=1c6284567ac5330ada8b403ccfe1b8ad126ef733]
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=18af9d99fc210d2d53ce545cf6c51c288649736e]
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creation complete after 0s [id=6e4b418d1e47f0a34bd56ef9ffbb378699d5cb1b]
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=88a5b330641eb9ce4b9083a250deecead2fa12bd]
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creation complete after 0s [id=ba4b09cb708fee8af8467381b3ccb467ed676194]
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip' archive
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/batchStarter
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): Created: builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=800a0697d8c9eafad1317b92fbaab7a52271d183]
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: creating 'builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip' archive
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/queryVCF
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): Created: builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creation complete after 0s [id=8134589134119453362]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=1ccd7a877dda82c1db34a8346160695f2ec53cde]
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creation complete after 0s [id=5865945383468324053]
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: creating 'builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip' archive
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/qcNotes
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): Created: builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip' archive
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/getResultsURL
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creation complete after 1s [id=3858218232790927018]
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 1s [id=6326550553961423041]
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip' archive
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/concatStarter
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): Created: builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: creating 'builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip' archive
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/updateReferenceFiles
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.sh
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: creating 'builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar_xmltobed.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: constraints.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: ensembl.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/concatPages
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: mirna.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): Created: builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/clearTempAndRegions
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): Created: builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: creating 'builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip' archive
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creation complete after 1s [id=5761105775097779277]
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=8134017008859075160]
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/initQuery
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): Created: builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/createPages
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): Created: builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creation complete after 1s [id=1905083761411757977]
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creation complete after 1s [id=1280236470133920915]
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creation complete after 1s [id=5939637829075640427]
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creation complete after 1s [id=1031823679640956384]
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: creating 'builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip' archive
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/pluginClinvar
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): Created: builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: creating 'builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip' archive
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/deleteClinicalWorkflow
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creation complete after 1s [id=4133450959732263947]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): Created: builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip' archive
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/batchSubmit
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): Created: builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Creation complete after 0s [id=831292757022756766]
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Creation complete after 0s [id=7560956386625967781]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: creating 'builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip' archive
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip' archive
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/queryVCFsubmit
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): Created: builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getMap
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): Created: builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creation complete after 0s [id=8681426599251965849]
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creation complete after 0s [id=6592979008540355956]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: creating 'builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip' archive
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: creating 'builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip' archive
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/queryGTF
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): Created: builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getAnalyses
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creation complete after 0s [id=2804917570928564744]
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_filtering_terms.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id_g_variants.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): Created: builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: creating 'builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip' archive
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/pluginGnomadConstraint
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creation complete after 0s [id=8397206699075853489]
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): Created: builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: creating 'builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getEntryTypes
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Created: builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip' archive
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creation complete after 1s [id=655828281715019771]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/performQuery
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_builder.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_engine.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): Created: builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: creating 'builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip' archive
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/concat
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creation complete after 1s [id=6609370973958808229]
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): Created: builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 1s [id=1223406225516832511]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creation complete after 1s [id=1044801428294880422]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/splitQuery
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): Created: builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creation complete after 1s [id=7022520528595515891]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: creating 'builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip' archive
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getFilteringTerms
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): Created: builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creation complete after 1s [id=6727874176547646979]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 1s [id=4019411715447240722]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creation complete after 1s [id=6194094341039815706]
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: creating 'builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip' archive
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getConfiguration
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): Created: builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creation complete after 1s [id=266926870119359430]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/getRuns
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creation complete after 0s [id=8637098692764308353]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 0s [id=6418485823427558169]
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: creating 'builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/security/lambda/sendSecurityAlert
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): zip: creating 'builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip' archive
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): Installing python requirements: sbeacon/lambda/generateCohortVCfs/requirements.txt
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/sbeacon/lambda/indexer
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: USER_GUIDE.md
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: ctas_queries.py
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-vd6iwko2
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_index.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_relations.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_terms.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-vd6iwko2
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): Created: builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creation complete after 0s [id=8651298991935041406]
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip' archive
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/svep/lambda/pluginGnomad
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): Created: builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creation complete after 0s [id=915700741196699367]
module.svep[0].aws_lambda_layer_version.binaries_layer: Creating...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creation complete after 1s [id=5968924290460716664]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendRegistrationEmail/requirements.txt
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-z15oxlor
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-z15oxlor
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): zip: creating 'builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip' archive
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/customMessageLambdaTrigger/requirements.txt
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-0jhcgwp0
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-0jhcgwp0
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: creating 'builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip' archive
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/276/default/error_catcher/lambda/notifyOnError
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): Created: builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creation complete after 1s [id=4346340681080815885]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip' ar
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.